# Desafio 1

Para esse desafio, vamos trabalhar com o data set [Black Friday](https://www.kaggle.com/mehdidag/black-friday), que reúne dados sobre transações de compras em uma loja de varejo.

Vamos utilizá-lo para praticar a exploração de data sets utilizando pandas. Você pode fazer toda análise neste mesmo notebook, mas as resposta devem estar nos locais indicados.

> Obs.: Por favor, não modifique o nome das funções de resposta.

## _Set up_ da análise

In [73]:
import pandas as pd
import numpy as np

In [74]:
black_friday = pd.read_csv("black_friday.csv")

## Inicie sua análise a partir daqui

In [75]:
black_friday.columns

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3', 'Purchase'],
      dtype='object')

In [4]:
df = black_friday

In [5]:
df.head(3)

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 537577 entries, 0 to 537576
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     537577 non-null  int64
 1   Product_ID                  537577 non-null  object
 2   Gender                      537577 non-null  object
 3   Age                         537577 non-null  object
 4   Occupation                  537577 non-null  int64
 5   City_Category               537577 non-null  object
 6   Stay_In_Current_City_Years  537577 non-null  object
 7   Marital_Status              537577 non-null  int64
 8   Product_Category_1          537577 non-null  int64
 9   Product_Category_2          370591 non-null  float64
 10  Product_Category_3          164278 non-null  float64
 11  Purchase                    537577 non-null  int64
dtypes: float64(2), int64(5), object(5)
memory usage: 49.2+ MB

In [203]:
df[['Product_Category_1','Product_Category_2','Product_Category_3']].head(7)

   Product_Category_1  Product_Category_2  Product_Category_3
0                   3                 NaN                 NaN
1                   1                 6.0                14.0
2                  12                 NaN                 NaN
3                  12                14.0                 NaN
4                   8                 NaN                 NaN
5                   1                 2.0                 NaN
6                   1                 8.0                17.0

In [207]:
aux = pd.DataFrame({'colunas' : df.columns, 'tipos' : df.dtypes, 'missing': df.isna().sum()})

In [209]:
aux.head()

               colunas   tipos  missing
User_ID        User_ID   int64        0
Product_ID  Product_ID  object        0
Gender          Gender  object        0
Age                Age  object        0
Occupation  Occupation   int64        0

In [210]:
aux['missing_percentual'] = aux['missing'] / df.shape[0]

In [213]:
aux

,colunas,tipos,missing,missing_percentual
User_ID,User_ID,int64,0,0.000000
Product_ID,Product_ID,object,0,0.000000
Gender,Gender,object,0,0.000000
Age,Age,object,0,0.000000
Occupation,Occupation,int64,0,0.000000
City_Category,City_Category,object,0,0.000000
Stay_In_Current_City_Years,Stay_In_Current_City_Years,object,0,0.000000
Marital_Status,Marital_Status,int64,0,0.000000
Product_Category_1,Product_Category_1,int64,0,0.000000
Product_Category_2,Product_Category_2,float64,166986,0.310627
Product_Category_3,Product_Category_3,float64,373299,0.694410
Purchase,Purchase,int64,0,0.000000

In [10]:
df.shape

(537577, 12)

In [11]:
df.Product_ID.nunique()

3623

In [12]:
df.dtypes

User_ID                         int64
Product_ID                     object
Gender                         object
Age                            object
Occupation                      int64
City_Category                  object
Stay_In_Current_City_Years     object
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
Purchase                        int64
dtype: object

In [13]:
df.dtypes.value_counts()

int64      5
object     5
float64    2
dtype: int64

In [14]:
df.Age.value_counts()

26-35    214690
36-45    107499
18-25     97634
46-50     44526
51-55     37618
55+       20903
0-17      14707
Name: Age, dtype: int64

In [270]:
q2 = df[df.Age == '26-35']

In [271]:
q2.User_ID.nunique()

2053

In [272]:
q2.shape[0]

214690

In [273]:
q2.User_ID.value_counts()

1001680    1025
1001150     752
1002909     717
1002063     708
1004344     705
           ...
1003291       7
1003542       7
1002690       7
1005391       6
1000708       5
Name: User_ID, Length: 2053, dtype: int64

In [274]:
q2.groupby('Gender')['User_ID'].nunique()

Gender
F     545
M    1508
Name: User_ID, dtype: int64

In [275]:
mean = df.Purchase.mean()

In [276]:
std = df.Purchase.std()

In [277]:
df.Purchase_norm = (df.Purchase - mean) / std

In [278]:
df.Purchase_norm

0        -0.193506
1         1.177698
2        -1.588401
3        -1.661679
4        -0.274012
            ...
537572    0.467804
537573    1.979943
537574   -0.259156
537575   -0.434019
537576   -0.493646
Name: Purchase, Length: 537577, dtype: float64

In [279]:
pd.cut(df.Purchase_norm, labels = ('Menor que 1', 'Maior que 1'), bins = (-1000, 1,1000))

0         Menor que 1
1         Maior que 1
2         Menor que 1
3         Menor que 1
4         Menor que 1
             ...
537572    Menor que 1
537573    Maior que 1
537574    Menor que 1
537575    Menor que 1
537576    Menor que 1
Name: Purchase, Length: 537577, dtype: category
Categories (2, object): [Menor que 1 < Maior que 1]

In [268]:
#10
df[df.isna()]

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
537572,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
537573,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
537574,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
537575,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
537576,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [28]:
df.isna().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            166986
Product_Category_3            373299
Purchase                           0
dtype: int64

In [29]:
df[['Product_Category_2','Product_Category_3']].isna()

        Product_Category_2  Product_Category_3
0                     True                True
1                    False               False
2                     True                True
3                    False                True
4                     True                True
...                    ...                 ...
537572               False                True
537573               False               False
537574               False                True
537575                True                True
537576               False                True

[537577 rows x 2 columns]

In [30]:
df['Product_Category_2'].isna().equals(df['Product_Category_3'].isna())

False

## Questão 1

Quantas observações e quantas colunas há no dataset? Responda no formato de uma tuple `(n_observacoes, n_colunas)`.

In [37]:
def q1():
    obs_col = black_friday.shape
    return obs_col

## Questão 2

Há quantas mulheres com idade entre 26 e 35 anos no dataset? Responda como um único escalar.

In [197]:
def q2():
    mulheres = black_friday[black_friday['Gender'] == 'F']
    mulheres_26_35 = mulheres[mulheres['Age'] == '26-35']
    mulheres_26_35 = mulheres_26_35['User_ID'].nunique()
    return mulheres_26_35

## Questão 3

Quantos usuários únicos há no dataset? Responda como um único escalar.

In [198]:
def q3():
    return black_friday.User_ID.nunique()

## Questão 4

Quantos tipos de dados diferentes existem no dataset? Responda como um único escalar.

In [247]:
def q4():
    return black_friday.dtypes.value_counts()

## Questão 5

Qual porcentagem dos registros possui ao menos um valor null (`None`, `ǸaN` etc)? Responda como um único escalar entre 0 e 1.

In [239]:
def q5():
    porc_reg = black_friday.isna().sum() / black_friday.shape[0]
    return porc_reg

## Questão 6

Quantos valores null existem na variável (coluna) com o maior número de null? Responda como um único escalar.

In [245]:
def q6():
    return black_friday.isnull().sum().max()

## Questão 7

Qual o valor mais frequente (sem contar nulls) em `Product_Category_3`? Responda como um único escalar.

In [249]:
def q7():
    commom_value = black_friday.Product_Category_3.value_counts()
    return commom_value[]

## Questão 8

Qual a nova média da variável (coluna) `Purchase` após sua normalização? Responda como um único escalar.

In [311]:
def q8():
    purch_orig_min = black_friday_norm = black_friday['Purchase'] - black_friday['Purchase'].min()
    purch_max_min = black_friday['Purchase'].max() - black_friday['Purchase'].min()
    black_friday_purch_norm = purch_orig_min / purch_max_min
    nova_media = np.mean(black_friday_purch_norm)
    return nova_media

## Questão 9

Quantas ocorrências entre -1 e 1 inclusive existem da variáel `Purchase` após sua padronização? Responda como um único escalar.

In [361]:
def q9():
    black_friday_purch_padron = (black_friday.Purchase - black_friday.Purchase.mean()) / black_friday.Purchase.std()
    ocorr = black_friday_purch_padron[black_friday_purch_padron >= -1]
    ocorr = ocorr[ocorr <= 1]
    return ocorr.shape[0]

## Questão 10

Podemos afirmar que se uma observação é null em `Product_Category_2` ela também o é em `Product_Category_3`? Responda com um bool (`True`, `False`).

In [443]:
def q10():
    black_friday_prod_2_null = black_friday[black_friday['Product_Category_2'].isna()]
    boole = black_friday_prod_2_null['Product_Category_2'].equals(black_friday_prod_2_null['Product_Category_3'])
    return boole

In [444]:
q10()

True